#    -*- mode: org -*-


Archived entries from file /Users/jeff/jwm/proj/literate-emacs.d/convert-emacs-init-to-literate.org

*** DONE evaluating code blocks
     - State "DONE"       from              [2019-07-30 Tue 20:37]
Use C-c C-c in the block to evaluate it and insert its results in the emacs buffer.
By default, only ~emacs-lisp~ is supported; other languages must be explicitly turned on.
See the manual.  (where?)

#+BEGIN_SRC emacs-lisp
(+ 45 6)
#+END_SRC

#+RESULTS:
: 51

another example

#+name: echo
#+begin_src emacs-lisp :var input="echo'd"
input
#+end_src

#+RESULTS: echo
: echo'd

*** DONE zsh block examples
     - State "DONE"       from              [2019-07-30 Tue 20:37]
According to [[https://orgmode.org/manual/Languages.html#Languages][the manual]], this function will enable babel support for added languages

#+BEGIN_SRC emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)))
#+END_SRC

#+RESULTS:

Ok, that worked.  So now try to execute some shell
#+BEGIN_SRC shell
awk '{print $2}' <<=eod
every good boy
does fine
eod
#+END_SRC

#+RESULTS:
| good |
| fine |
|      |

Ok, now figure out how to name which shell is invoked
#+BEGIN_SRC shell
sh_pid=$(echo "$$")
ps uww $sh_pid
#+END_SRC

#+RESULTS:
| USER |  PID | %CPU | %MEM |     VSZ |  RSS | TT | STAT | STARTED |    TIME | COMMAND            |
| jeff | 6668 |  0.2 |  0.0 | 4308668 | 1840 | ?? | S    | 8:27PM  | 0:00.03 | /usr/local/bin/zsh |

good it is my shell; zsh

count how many lines are given to the input from a here document
#+BEGIN_SRC shell
  wc <<=eod
  every good boy
  does fine
  eod
#+END_SRC

#+RESULTS:
: 2       6      28

